Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
cropping2d_4 (Cropping2D)        (None, 65, 320, 3)    0           cropping2d_input_4[0][0]         
____________________________________________________________________________________________________
lambda_7 (Lambda)                (None, 40, 160, 3)    0           cropping2d_4[0][0]               
____________________________________________________________________________________________________
lambda_8 (Lambda)                (None, 40, 160, 3)    0           lambda_7[0][0]                   
____________________________________________________________________________________________________
convolution2d_10 (Convolution2D) (None, 10, 40, 16)    3088        lambda_8[0][0]                   
____________________________________________________________________________________________________
elu_14 (ELU)                     (None, 10, 40, 16)    0           convolution2d_10[0][0]           
____________________________________________________________________________________________________
convolution2d_11 (Convolution2D) (None, 5, 20, 32)     12832       elu_14[0][0]                     
____________________________________________________________________________________________________
elu_15 (ELU)                     (None, 5, 20, 32)     0           convolution2d_11[0][0]           
____________________________________________________________________________________________________
convolution2d_12 (Convolution2D) (None, 3, 10, 64)     51264       elu_15[0][0]                     
____________________________________________________________________________________________________
flatten_4 (Flatten)              (None, 1920)          0           convolution2d_12[0][0]           
____________________________________________________________________________________________________
elu_16 (ELU)                     (None, 1920)          0           flatten_4[0][0]                  
____________________________________________________________________________________________________
dense_8 (Dense)                  (None, 512)           983552      elu_16[0][0]                     
____________________________________________________________________________________________________
elu_17 (ELU)                     (None, 512)           0           dense_8[0][0]                    
____________________________________________________________________________________________________
dense_9 (Dense)                  (None, 1)             513         elu_17[0][0]                     
====================================================================================================
Total params: 1051249
____________________________________________________________________________________________________